/************************************************************ 
 * 덧셈 뺄셈 표현식 확인하기                                *
 ************************************************************/
#include <iostream>
using namespace std;

int main()
{
  // 덧셈 연산자
  cout << "덧셈 연산자 확인하기" << endl;   
  cout << "30 + 5 = " << 30 + 5 << endl;
  cout << "20.5 + 6.2 = " << 20.5 + 6.2 << endl;
  // 뺄셈 연산자
  cout << "뺄셈 연산자 확인하기" << endl;
  cout << "5 - 30 = " << 5 - 30 << endl;
  cout << "51.2 - 30.4 = " << 51.2 - 30.4 << endl;
  return 0;
}